function [B0,L0,P]=GetB0L0PbyDate(Year,Month,Day,Hour,Minute)
% 根据日期/时间计算日照坐标B0,L0和方位角P ；
% 输出:  日照坐标B0,L0和方位角P(单位：度)
%   P:从太阳圆盘北点向东测量的旋转轴北端的位置角;
%   B0:日照纬度
%   L0:日照经度
% 输入：年，月，日，时，分 (世界标准时间，UT)
% for i=1:31
% Day=i;
% 参考文献：
% Astronomical Algorithms 第22、25和28章

% 将时和分转换为天
Day=Day+Hour/24+Minute/24/60;

% 计算儒略日数
JD=GetTbyDate(Year,Month,Day);

% 中间参数
T=(JD-2451545.0)/36525;
LL=mod(280.46646+36000.76983*T+0.0003032*T^2,360);
M=mod(357.52911+35999.05029*T-0.000153*T^2,360);
% e=0.016708634-0.000042037*T-0.0000001267*T^2;
C=(1.914602-0.004817*T-0.000014*T^2)*sin(M*pi/180)+(0.019993-0.000101*T)*sin(2*M*pi/180)+0.000289*sin(3*M*pi/180);

% 好像是地球日心黄经
O_=LL+C;

% v=M+C;
% R=1.000001018*(1-e^2)/(1+e*cos(v));

Womiuga=125.04-1934.136*T;
% 需要的两个参数
Lamda=O_-0.00569-0.00478*sin(Womiuga*pi/180);
Lamda_=O_-1.397*T-0.00031*T^2;

epxlong0=23+26/60+21.448/3600-46.8150/3600*T-0.00059/3600*T^2+0.001813/3600*T^3;

L_=280.4665+36000.27698*T;
L__=218.3165+481267.28813*T;
Q=mod(125.04452-1934.136261*T+0.0020708*T^2+T^3/450000,360);
depxlong=9.20/3600*cos(Q*pi/180)+0.57/3600*cos(2*L_*pi/180)+0.1/3600*cos(2*L__*pi/180)-0.09/3600*cos(2*Q*pi/180);

% 需要的参数2，黄道的倾斜
epxlong=epxlong0+depxlong;

sita=mod((JD-2398220)*360/25.38,360); % 单位：度

I=7.25;     %单位：度
K=73.6667+1.3958333*(JD-2396758)/36525;    %单位：度

x=atan(-cos(Lamda_*pi/180)*tan(epxlong*pi/180))*180/pi;    %单位：度
y=atan(-cos((Lamda-K)*pi/180)*tan(I*pi/180))*180/pi;    %单位：度

P=x+y;    %单位：度
% P:从太阳圆盘北点向东测量的旋转轴北端的位置角;
% 当太阳旋转轴的北极向东倾斜时P为正，如果向西倾斜则为负。
% 天体和太阳北极可相差26度.
% P在4月7日左右达到最小值-26.3度，在10月11日左右达到最大值为+ 26.3度，
% ，在1月5日和7月7日附近为零。

B0=asin(sin((Lamda-K)*pi/180)*sin(I*pi/180))*180/pi;     %单位：度
% % B0:the heliographic latitude of the center of the solar disk
% B0代表太阳的北极向地球的（+）或远离（ - ）倾斜。
% 它在6月6日和12月7日为零，
% 并在3月6日（-7.25度）和9月8日（+7.25度）。

eina=atan(tan((Lamda-K)*pi/180)*cos(I*pi/180))*180/pi;    %单位：度
% eina应与Lamda-K-180处于同一象限 ？？？？？？？？？
% LK(i,1)=Lamda-K-180;
LK=Lamda-K-180;
eina_1=getQuadrantby_eina(eina);
LK_1=getQuadrantby_eina(LK);
if eina_1==LK_1
    eina=eina-180;
end
% 日照经度
% L0每天减少约13.2度。
% 平均朔望期为27.2752天。
% 每个“同步旋转”的开始是L0经过0°的瞬间。
% 1号旋转于1853年11月9日开始。
L0=mod(eina-sita-180,360);   %单位：度

end